{"description": "<br>Team Lead Java/JEE <br><br> Voici une occasion unique de faire partie d\u2019une \u00e9quipe de CGI situ\u00e9e \u00e0 Montr\u00e9al. Relevant du directeur services-conseils, au sein du Grand Montr\u00e9al, le candidat choisi agira \u00e0 titre de D\u00e9veloppeur Java S\u00e9nior. Ses responsabilit\u00e9s seront :Le candidat retenu travaillera avec les derni\u00e8res technologies Java et aura une exp\u00e9rience pratique dans le d\u00e9veloppement de sites web complexes, \u00e0 fort trafic. Le candidat se joindra \u00e0 une \u00e9quipe de d\u00e9veloppement tr\u00e8s prosp\u00e8re et croissante \u00e0 une organisation qui a pour principale mission d'augmenter la marque de l\u2019employeur.<br><br>Responsabilit\u00e9s g\u00e9n\u00e9rales :<br><br>- Responsable de la performance globale, la stabilit\u00e9 et la disponibilit\u00e9 des applications prises en charge fonctionnant sur Java (r\u00e9partition des t\u00e2ches : d\u00e9veloppement de 70% , le soutien de 30%);<br>- Responsable de la gestion au jour le jour de l'\u00e9quipe de support d'application (actuellement 3 personnes - Forte capacit\u00e9 \u00e0 r\u00e9aliser diverses activit\u00e9s de support logiciel (analyse, codage, tests, d\u00e9bogage, la maintenance et documentation;<br>- \u00catre une r\u00e9f\u00e9rence technique pour l'\u00e9quipe de support d'application et le client (y compris les examens de code et de la documentation) ;<br>- Participer \u00e0 la planification et \u00e0 l'estimation des am\u00e9liorations et des efforts;<br>- Participer \u00e0 la mise en place du groupe de soutien de la demande et soutenir la demande;<br>- Collaborer avec l'\u00e9quipe QA pendant les phases de validation pour identifier les meilleurs sc\u00e9narios de test et corriger les probl\u00e8mes identifi\u00e9s;<br>- La gestion des incidents (urgence et maintenance corrective - l'application et le serveur d'applications);<br>- Mener des phases de diagnostic lorsque des d\u00e9faillances ou des probl\u00e8mes de performance (proactives et r\u00e9actives);<br>-Heures de support - calendrier de rotation avec les membres de l'\u00e9quipe (une fois toutes les 4 semaines, le candidat devra \u00eatre sur appel et tenir un t\u00e9l\u00e9avertisseur) avec compensation ($).<br><br>EXIGENCES<br><br>- Ma\u00eetrise de l'anglais parl\u00e9 et \u00e9crit en fran\u00e7ais et en anglais;<br>- Baccalaur\u00e9at en informatique (ou \u00e9quivalent);<br>- 5 ans d'exp\u00e9rience dans les technologies front-end : Java , Apache Solr , Tomcat, RightScale sur AWS;<br>- Exp\u00e9rience dans un environnement SOA web;<br>- Connaissances de Linux, Nagios, New Relic (atout);<br>- Exp\u00e9rience en JavaScript ( jQuery, QUnit , JSON / P);<br>- Possibilit\u00e9 d'ex\u00e9cuter et d'interpr\u00e9ter les sessions de profilage pour identifier les goulots d'\u00e9tranglement et am\u00e9liorer la performance;<br>- Bonne connaissance des mod\u00e8les de conception orient\u00e9e objet;<br>- Aptitude \u00e0 effectuer dans un environnement multi-projets;<br>- Aptitude \u00e0 travailler de mani\u00e8re flexible et ind\u00e9pendante avec un minimum de supervision;<br><br>Excellente connaissance th\u00e9orique et pratique des technologies et des concepts suivants :<br><br>- Conception orient\u00e9e objet;<br>- Configuration d'application ( Tomcat ) et web (Apache);<br>- Spring, Hibernate , Maven , SVN , etc ;<br>- Programmation SOA ( JSON, REST , etc.);<br><br>Connaissance pratique des technologies et des concepts suivants est un atout important :<br><br>- Des outils d'optimisation et de profilage;<br>- Architecture logicielle Web;<br>- Les projets Web impliquant des r\u00e9seaux sociaux;<br>- Le d\u00e9veloppement d'applications mobiles;<br>- Exp\u00e9rience de travail en \u00e9quipe en utilisant une m\u00e9thodologie agile.<br><br> Chez CGI, nous sommes une \u00e9quipe de b\u00e2tisseurs. Chacun de nos membres (ou employ\u00e9s) concourt \u00e0 b\u00e2tir sa propre entreprise - une firme qui regroupe 68,000 professionnels pr\u00e9sents dans 40 pays. Fond\u00e9e en 1976, CGI est un chef de file des services en TI et en gestion des processus d\u2019affaires qui contribue au succ\u00e8s de ses clients. Nos clients - tout comme nos membres - peuvent compter sur nos ressources mondiales, sur notre savoir-faire, sur notre stabilit\u00e9 et sur nos professionnels chevronn\u00e9s pour obtenir les r\u00e9sultats escompt\u00e9s. Joignez-vous \u00e0 nous. Pour en savoir davantage : www.cgi.com.<br><br>Cette offre est une excellente occasion de vous joindre \u00e0 une \u00e9quipe gagnante. CGI offre des conditions de r\u00e9mun\u00e9ration avantageuses et des possibilit\u00e9s de croissance et de d\u00e9veloppement professionnel. Les avantages des membres permanents \u00e0 temps plein entrent en vigueur d\u00e8s le premier jour et comprennent des vacances pay\u00e9es, un r\u00e9gime de participation aux b\u00e9n\u00e9fices ainsi qu\u2019un r\u00e9gime de participation \u00e0 l\u2019actionnariat.<br><br>Nous aimerions remercier tous les candidats de leur int\u00e9r\u00eat pour notre organisation. Cependant, nous communiquerons seulement avec les candidats retenus.<br><br>Les candidatures non sollicit\u00e9es provenant d'agences de placement ne seront pas retenues.<br><br>CGI FAVORISE L'\u00c9QUIT\u00c9 EN MATI\u00c8RE D'EMPLOI. <br><br><br><br><br> Java (senior) Application support / team lead <br><br> Selected candidate will work with the latest Java technologies and have practical experience in developing complex, high-traffic websites. Candidate will join a highly successful and growing development team at an organisation who main mission is to increase brand power. <br><br>Overall responsibilities: <br><br>- Responsible for the overall performance, stability and availability of supported applications running on Java (breakdown of tasks: 70% development, 30% support)<br>- Responsible for the day-to-day management of the application support team (currently 3 people, potential growth to come);<br>- Strong ability to carry out various software support activities (analyzing, coding, testing, debugging, maintenance and documentation);<br>- Be a technical reference for the application support team and client (including code reviews and documentation);<br>- Participate in the planning and estimating of enhancements and effort;<br>- Participate in the implementation the application support group and support the application;<br>- Collaborate with the QA team during the validation phases to identify the best test scenarios and correct the problems identified;<br>- Incident management (emergency and corrective maintenance \u2013 application &amp; application server);<br>- Conduct diagnostic phases when failures or performance problems (proactive and reactive)<br>- Off hours support - Rotation schedule with team members (once every 4 weeks candidate will need to be on-call and hold a pager) with compensation $<br><br>Skillset:<br><br>- Fluency in spoken and written French and English<br>- Bachelor's degree in Computer Science (or equivalent)<br>- 5+ years of experience in front end technologies: Java, Apache Solr, Tomcat, RightScale on AWS<br>- Experience in web SOA environment<br>- Knowledge of Linux, Nagios, New Relic (asset)<br>- Experience in JavaScript (jQuery, qUnit, JSON/P)<br>- Ability to run and interpret profiling sessions to identify bottle necks and improve performance<br>- Strong knowledge of object-oriented design models<br>- Demonstrated ability to perform in a multi-project environment<br>- Demonstrated ability to work flexibly and independently with minimal supervision<br><br>Excellent theoretical and practical knowledge of the following technologies and concepts:<br><br>- Object-oriented design<br>- Configuration of application (Tomcat) and web (Apache)<br>- Spring, Hibernate, Maven, SVN, etc..<br>- Programming SOA (JSon, REST, etc.).<br><br>Practical knowledge of the following technologies and concepts is an important asset:<br><br>- Optimization tools and profiling<br>- Web software architecture<br>- Web projects involving social networks;<br>- Mobile application development<br>- Experience working in a team using an agile methodology At CGI, we\u2019re a team of builders. We call our employees members because all who join CGI are building their own company - one that has grown to 68,000 professionals located in 40 countries. Founded in 1976, CGI is a leading IT and business process services firm committed to helping clients succeed. We have the global resources, expertise, stability and dedicated professionals needed to achieve results for our clients - and for our members. Come grow with us. Learn more at www.cgi.com.<br><br>This is a great opportunity to join a winning team. CGI offers a competitive compensation package with opportunities for growth and professional development. Benefits for full-time, permanent members start on the first day of employment and include a paid time-off program and profit participation and stock purchase plans.<br><br>We wish to thank all applicants for their interest and effort in applying for this position, however, only candidates selected for interviews will be contacted. <br><br>No unsolicited agency referrals please.<br><br>WE ARE AN EQUAL OPPORTUNITY EMPLOYER. <br> <br><br> <strong>Skills</strong>", "company": {"id": 1415, "name": "CGI"}, "postingDate": {"year": 2014, "day": 20, "month": 1}, "locationDescription": "Montreal, QC", "expirationDate": {"year": 2014, "day": 21, "month": 3}, "position": {"experienceLevel": {"code": "0", "name": "Not Applicable"}, "location": {"country": {"code": "ca"}, "name": "Canada"}, "jobType": {"code": "F", "name": "Full-time"}, "title": "Java (senior) Application support / team lead"}, "active": true, "customerJobCode": "289936", "expirationTimestamp": 1395381948000, "id": 10620314, "postingTimestamp": 1390197947000}