{"description": "<p>Reporting to the Logistics and Import/Export Sr. Team Lead, the WMS Developer will manage Catalyst Warehouse Management System (WMS) and support Aldo Group distribution execution. </p><p>\u00a0 </p><p>The tasks would include analysis, data manipulation, documentation, and assisting with process redesigns.\u00a0 </p><p>\u00a0 </p><p>The ideal candidate will have a strong technical aptitude, business or logistics background and strong problem solving abilities. This is an exciting opportunity to combine your technological abilities, ability to learn and enthusiasm to produce innovative and creative solutions. </p><p>\u00a0<br>  \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 </p><p><span style=\"text-decoration:underline\"><strong>Key responsibilities</strong></span> </p><p>\u00a0 </p><ul><li>Support the Catalyst warehouse management system (WMS). </li><li>Analyze and solve complex business issues with solid, scalable and technical solutions </li><li>Provide technical assistance to identify, evaluate, design, validate business processes </li><li>Participate in cross functional team to solve business issues </li><li>Propose new process and/or enhancement to the current processes<p> </p></li></ul><p><br>Relevant du chef de l\u2019\u00e9quipe de logistique et d\u2019import-export, le d\u00e9veloppeur ou la d\u00e9veloppeuse SGE prendra en charge le syst\u00e8me Catalyst et apportera son soutien au processus de distribution du Groupe ALDO. </p><p>\u00a0 </p><p>Ses t\u00e2ches incluront l\u2019analyse, la manipulation de donn\u00e9es, la documentation, et la participation \u00e0 la reconfiguration des proc\u00e9dures. </p><p>\u00a0 </p><p>Il ou elle devra poss\u00e9der de solides aptitudes techniques, une exp\u00e9rience relative aux affaires ou \u00e0 la logistique, ainsi qu\u2019une habilet\u00e9 sup\u00e9rieure \u00e0 r\u00e9soudre des probl\u00e8mes. Ce sera pour lui ou elle une occasion id\u00e9ale de mettre \u00e0 profit ses comp\u00e9tences technologiques, sa capacit\u00e9 d\u2019apprentissage et son enthousiasme afin de trouver et de d\u00e9ployer des solutions aussi innovatrices que cr\u00e9atives. </p><p>\u00a0<br>  \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 \u00a0 </p><p><span style=\"text-decoration:underline\"><strong>Responsabilit\u00e9s principales</strong></span> </p><p>\u00a0 </p><ul><li>S\u2019occuper du bon fonctionnement du syst\u00e8me de gestion d\u2019entrep\u00f4t Catalyst. </li><li>Diagnostiquer et r\u00e9soudre des probl\u00e8mes d\u2019affaires complexes en proposant des solutions stables, techniques et extensibles. </li><li>Offrir une assistance technique permettant d\u2019identifier, d\u2019\u00e9valuer, de conceptualiser et de valider les processus d\u2019affaires. </li><li>S\u2019impliquer dans les \u00e9quipes interservices pour aider \u00e0 r\u00e9soudre les probl\u00e8mes techniques et op\u00e9rationnels. </li><li>Sugg\u00e9rer des nouveaut\u00e9s ou des am\u00e9liorations pour les processus existants.</li></ul>", "company": {"id": 18641, "name": "ALDO Group"}, "skillsAndExperience": "<ul><li>Good knowledge of the following technologies: </li><ul><li>Oracle databases (SQL, Oracle PL SQL) </li><li>Unix / Linux\u00a0 (Korn shell script) </li><li>C++ </li><li>Java </li></ul></ul><ul><li>Good organizational and administrative skills </li><li>Good understanding of the distribution processes </li></ul><ul><li>Analytical and process mapping skills </li><li>Supply Chain/Logistics experience an asset </li><li>Catalyst WMS experience an asset<p> </p></li></ul><p><span style=\"text-decoration:underline\"><strong>Exigences principales</strong></span> </p><p>\u00a0 </p><ul><li>Bonne connaissance des applications suivantes\u00a0: </li><ul><li>Bases de donn\u00e9es Oracle (SQL et PL/SQL) </li><li>Unix ou Linux (interpr\u00e9teur de commandes Korn) </li><li>C++ </li><li>Java </li></ul></ul><ul><li>Excellentes aptitudes organisationnelles et administratives </li><li>Bonne compr\u00e9hension du processus de distribution des marchandises </li></ul><ul><li>Habilet\u00e9s d\u2019analyse et de cartographie des processus </li><li>Exp\u00e9rience relative \u00e0 la logistique ou la chaine d\u2019approvisionnement, un atout </li><li>Connaissance du syst\u00e8me Catalyst, un atout</li></ul>", "postingDate": {"year": 2014, "day": 26, "month": 2}, "locationDescription": "Montreal, Canada Area", "expirationDate": {"year": 2014, "day": 28, "month": 3}, "active": true, "position": {"experienceLevel": {"code": "3", "name": "Associate"}, "location": {"country": {"code": "ca"}, "name": "Montreal, Canada Area"}, "jobType": {"code": "F", "name": "Full-time"}, "title": "Warehouse Management System Developer/D\u00e9veloppeur ou d\u00e9veloppeuse, syst\u00e8me de gestion d\u2019entrep\u00f4t (SGE)"}, "expirationTimestamp": 1396022915000, "id": 11884204, "postingTimestamp": 1393430914000}