{"description": "Cisco Systems (Canada) Co Location of work: <br><br> 2000 Innovation Drive, Kanata, Ontario K2K 3E8, Canada <br><br> Business Address: 3000 Innovation Drive Ottawa, Ontario K2K 3E8, Canada <br><br> Title: Software Engineer <br><br> Term of employment: Permanent, Regular full-time <br><br> Wage Range: CAD 130,000 to 148,000 <br><br> Benefits: Medical/Dental/Vision/Disability/Life <br><br> Contact Information of recruiter: Bobby Nanda- Technical Recruiter (503) 270- 7118 or bonanda@cisco.com <br><br> For years, Cisco Systems (Canada) CO's vision has been to change the way the world works, lives, plays, and learns. Our vision is more relevant today than ever. We made the Internet what it is today. First, we focused on creating connectivity. Now, we're entering the Internet of Everything transition\u2014an era where we'll help create unprecedented value by connecting the unconnected. The Internet of Everything is a global industry phenomenon that is driving the biggest market transition for Cisco Systems (Canada) Co and our customers. This includes the intelligent connection of people, process, data, and things. It's where everything is converged on the Internet, making networked connections more relevant and valuable than before. To help us bring this vision to life, join us in our exciting journey. <br><br> Cisco Systems (Canada) Co is seeking a full time software engineer with these skill-sets, to work on a enterprise solution for automating the workflow of embedded development engineers. In addition to having at least 5 years of experience developing embedded software for networking products using C on RPM based Linux platform including any proprietary networking OS, the candidate must have hands-on experience in Java based application development for enterprise-class products and are required to have excellent knowledge and working experience in these tools and technologies: <br><br> \u00b7 Expert understanding of Object Oriented analysis and design techniques <br><br> \u00b7 Message Oriented Middleware (MOM) - Apache ActiveMQ Broker and JMS <br><br> \u00b7 Java Integration Technologies (Spring Integration &amp; Apache Camel) <br><br> \u00b7 Cassandra NoSQL Key-Value distributed store <br><br> \u00b7 JSF web technologies deployed under JBoss Version 7.x or higher <br><br> \u00b7 Oracle RDBMS data design and modeling <br><br> \u00b7 Object Oriented Perl scripting <br><br> \u00b7 Apache ServiceMix ESB <br><br> \u00b7 JBoss Version 7.x or higher <br><br> \u00b7 Hadoop distributed data analysis and Pentaho visualization <br><br> \u00b7 CCNA <br><br> *Ability to support and extend existing systems by analyzing and identifying areas for modification based on scalability issues, allowing it to adapt to new hardware, or to improve its performance. <br><br> *Create technical specifications, functional and design specs and write unit, integration, and regression test plans. <br><br> *Must have experience mentoring and leading a small team of 2 to 4 engineers, including day to day work assignment, preparing schedules. <br><br> *Experience working on an Agile development environment would be a plus. <br><br> *Excellent verbal and written communication skills as well as receptive listening skills. <br><br> *Broad knowledge of and exposure to network protocols as well as embedded and real-time operating systems. <br><br> *Requires MS in Computer Science or electronics or electrical engineering with 7+ years of experience or equivalent or BS in CS/electronics/electrical engineering with 10+ years of experience <br><br> The candidate will be responsible for the following duties: \u2022 Gather Product requirement from cisco engineering stakeholders \u2022 Provide engineering solutions to product requirements \u2022 Design tooling solutions \u2022 Develop and implement tooling solutions \u2022 Deploy, maintain and support products \u2022 Mentor and lead a group of junior and senior software engineers \u2022 Engage with internal cisco partner engineering teams \u2022 Engage with external vendors for tooling solutions <br><br> Les Syst\u00e8mes Cisco Canada cie Lieu de travail : <br><br> 2000, promenade Innovation Kanata, Ontario K2k 3E8, Canada <br><br> Adresse professionnelle : 3000 promenade Innovation Ottawa, Ontario K2K 3E8, Canada <br><br> D\u00e9signation du poste : sp\u00e9cialiste en g\u00e9nie logiciel <br><br> Modalit\u00e9 d'emploi : emploi permanent r\u00e9gulier \u00e0 temps plein <br><br> Plage de r\u00e9mun\u00e9ration : 130 000 \u00e0 148 000 $CA <br><br> Avantages sociaux : r\u00e9gimes de soins de sant\u00e9, de soins dentaires et de soins de la vue, assurance-invalidit\u00e9, assurance-vie <br><br> Coordonn\u00e9es du recruteur : Bobby Nanda Recruteur technique 503 270-7118 bonanda@cisco.com <br><br> Depuis des ann\u00e9es, Cisco \u0153uvre pour r\u00e9aliser sa vision de changer la fa\u00e7on de travailler, de vivre, de se divertir et d\u2019apprendre des gens. Aujourd\u2019hui, cette vision est plus pertinente que jamais. Nous avons fait d\u2019Internet ce qu\u2019il est maintenant. Nous avons commenc\u00e9 par cr\u00e9er la connectivit\u00e9. \u00c0 pr\u00e9sent, nous entrons dans l\u2019\u00e8re de l\u2019Internet multidimensionnel \u2013 une \u00e8re o\u00f9 nous aiderons \u00e0 cr\u00e9er de la valeur sans pr\u00e9c\u00e9dent en connectant tout ce qui ne l\u2019est pas d\u00e9j\u00e0. L\u2019Internet multidimensionnel, ph\u00e9nom\u00e8ne mondial, est la force motrice derri\u00e8re la plus importante transition de march\u00e9 pour Cisco Canada et nos clients. Il relie les personnes, processus, donn\u00e9es et objets de mani\u00e8re intelligente. Il constitue le lieu o\u00f9 tout converge, rendant les connexions r\u00e9seaut\u00e9es plus pertinentes et utiles que jamais. Soyez des n\u00f4tres dans cet extraordinaire p\u00e9riple pour insuffler vie \u00e0 cette vision. <br><br> Exigences : Les Syst\u00e8mes Cisco Canada cie est \u00e0 la recherche d'un sp\u00e9cialiste en g\u00e9nie logiciel \u00e0 temps plein poss\u00e9dant les comp\u00e9tences list\u00e9es ci-dessous, pour travailler sur une solution d'entreprise servant \u00e0 automatiser le flux de travaux de sp\u00e9cialistes en conception logicielle. <br><br> En plus d'avoir au moins 5 ans d'exp\u00e9rience de conception de logiciels int\u00e9gr\u00e9s pour des produits de r\u00e9seau utilisant le langage C sur une plateforme Linux fond\u00e9e sur RPM, dont tout syst\u00e8me d'exploitation de r\u00e9seau propri\u00e9taire, le candidat doit poss\u00e9der une exp\u00e9rience pratique du langage Java fond\u00e9 sur le d\u00e9veloppement d'applications pour des produits de classe entreprise. Il doit aussi avoir une excellente connaissance et une exp\u00e9rience pratique des technologies et outils suivants : <br><br> \u00b7 compr\u00e9hension approfondie de l'analyse orient\u00e9e objet et des techniques de conception; <br><br> \u00b7 intergiciels ax\u00e9s sur les messages (Message Oriented Middleware ou MOM) - Apache ActiveMQ Broker et JMS; <br><br> \u00b7 technologies d'int\u00e9gration Java (Spring Integration et Apache Camel); <br><br> \u00b7 base de donn\u00e9es cl\u00e9-valeur distribu\u00e9e Cassandra NoSQL; <br><br> \u00b7 technologies Web JSF d\u00e9ploy\u00e9es sur JBoss version 7.x ou une version plus r\u00e9cente; <br><br> \u00b7 conception et modelage de donn\u00e9es Oracle RDBMS; <br><br> \u00b7 langage de script Perl orient\u00e9 objet; <br><br> \u00b7 Apache ServiceMix ESB; <br><br> \u00b7 JBoss Version 7.x ou une version plus r\u00e9cente; <br><br> \u00b7 analyse de donn\u00e9es distribu\u00e9es Hadoop et visualisation Pentaho. <br><br> \u00b7 CCNA <br><br> *Capacit\u00e9 de soutenir et d'\u00e9tendre des syst\u00e8mes en place en analysant et en pr\u00e9cisant les secteurs de modification fond\u00e9s sur des questions d'\u00e9volutivit\u00e9, en permettant \u00e0 ces syst\u00e8mes de s'adapter \u00e0 de nouveaux logiciels ou d'am\u00e9liorer leur performance. <br><br> *Capacit\u00e9 de cr\u00e9er des sp\u00e9cifications techniques, fonctionnelles et conceptionnelles et de r\u00e9diger des plans de mise \u00e0 l'essai d'unit\u00e9, d'int\u00e9gration et de r\u00e9gression. Exp\u00e9rience de mentorat et de direction d'une petite \u00e9quipe de 2 \u00e0 4 sp\u00e9cialistes en ing\u00e9nierie comportant l'attribution quotidienne de t\u00e2ches et la pr\u00e9paration d'horaires. <br><br> *Exp\u00e9rience de travail dans un environnement de d\u00e9veloppement agile, un atout. <br><br> *Excellentes habilet\u00e9s de communication verbales et \u00e9crites et aptitudes d'\u00e9coute r\u00e9ceptives. <br><br> *Vaste connaissance et exp\u00e9rience pratique des protocoles de r\u00e9seau ainsi que des syst\u00e8mes d'exploitation int\u00e9gr\u00e9s et en temps r\u00e9el. <br><br> *Ma\u00eetrise en informatique, en \u00e9lectronique ou en g\u00e9nie \u00e9lectrique avec au moins 7 ans d'exp\u00e9rience ou l'\u00e9quivalent ou baccalaur\u00e9at en informatique, en \u00e9lectronique ou en g\u00e9nie \u00e9lectrique avec au moins 10 ans d'exp\u00e9rience. <br><br> Le candidat retenu sera responsable des t\u00e2ches suivantes : \u2022 recueillir les exigences relatives aux produits des parties prenantes en ing\u00e9nierie de Cisco; \u2022 fournir des solutions d'ing\u00e9nierie satisfaisant les exigences des produits; \u2022 concevoir des solutions de r\u00e9glage; \u2022 d\u00e9velopper et impl\u00e9menter des solutions de r\u00e9glage; \u2022 d\u00e9ployer, maintenir et soutenir des produits; \u2022 mentorer et diriger un groupe de sp\u00e9cialistes en g\u00e9nie logiciel \u2013 adjoints et principaux; \u2022 collaborer avec des \u00e9quipes internes d'ing\u00e9nierie de partenaires de Cisco; \u2022 collaborer avec des fournisseurs externes sur les solutions de r\u00e9glage.", "company": {"id": 1063, "name": "Cisco"}, "postingDate": {"year": 2014, "day": 22, "month": 1}, "locationDescription": "OTTAWA, ON", "expirationDate": {"year": 2014, "day": 23, "month": 3}, "position": {"experienceLevel": {"code": "4", "name": "Mid-Senior level"}, "location": {"country": {"code": "ca"}, "name": "Canada"}, "jobType": {"code": "F", "name": "Full-time"}, "title": "Software Engineer"}, "active": true, "customerJobCode": "S959591", "expirationTimestamp": 1395562346000, "id": 10652845, "postingTimestamp": 1390378346000}