{"description": "<br>Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries.<br><br> As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture. <br><br> The mission of the Global Technology division is to provide a highly reliable and commercial technology platform, which supports the Firm\u2019s strategy, delivered by an innovative, world-class team of professionals. There are ten divisions within Technology. <br><br> Corporate and Post-Trade Technology (CPT) is comprised of four client-aligned groups that provide technology solutions for enterprise-wide divisions such as Legal &amp; Compliance, Finance and Firm Risk, as well as the Post-Trade function within the Institutional Securities Division. Each client-aligned group consists of a set of Practice Areas, which provide technology to support a related set of functions. The Post-Trade Technology group develops and supports systems used to automate global operations business processes, such as settlement and book keeping, which occur once a trade is booked and confirmed with the client. Post-Trade Technology consists of three practice area groups: Cross Product Services, Operational Risk &amp; Control and OTC Derivatives. <br><br> We are seeking a senior Informatica developer to join our Corporate Tax IT group to develop and support applications for the Corporate Tax Finance division. Corporate Tax is renovating their current technology systems and increasing their systematic touch-points with current vendor software. In this hands-on development role, the candidate will work with a globally distributed team of developers to design and develop technology components through a series of complex IT projects. The candidate will also be assisting the development manager in project planning and execution. This includes critical analysis of key business processes and making architectural and technical recommendations to promote efficient and supportable processes.<br><br> Role requires hands-on design, development, implementation, support and optimization of the applications. Candidate should be experienced in object-oriented techniques and software engineering best practices such as SDLC, design reviews, code reviews, unit testing, and re-factoring. Role includes engagement with onsite and offshore technical team, as well as working with a variety of stakeholders and personnel throughout organization. Candidate should be able to work independently and have strong problem solving and analytic skills.<br><br>Morgan Stanley est un chef de file mondial des services financiers qui offre un large \u00e9ventail de services de banque d'investissement, d'op\u00e9rations sur titres, de gestion de placements et de gestion de patrimoine. Les employ\u00e9s de la Soci\u00e9t\u00e9 servent des clients du monde entier, notamment des entreprises, des gouvernements et des personnes physiques \u00e0 partir de plus de 1 200 bureaux dans 43 pays.<br><br>Le talent et l'enthousiasme de notre personnel sont vitaux pour un chef de file tel que nous. Nous avons en commun un ensemble de valeurs caract\u00e9ris\u00e9es par l'int\u00e9grit\u00e9, le souci de l'excellence et la rigueur des r\u00e8gles d'\u00e9thique appliqu\u00e9es par nos \u00e9quipes. Morgan Stanley peut offrir un environnement sup\u00e9rieur pour b\u00e2tir une carri\u00e8re professionnelle : un milieu o\u00f9 il est possible d'apprendre, d'accomplir et de progresser. L'\u00e9quilibre entre le style de vie, les objectifs et les besoins de chacun est une philosophie au c\u0153ur de sa culture.<br><br>La technologie constitue un partenaire strat\u00e9gique qui collabore avec les unit\u00e9s d\u2019exploitation de Morgan Stanley et les entreprises chefs de file du secteur de la technologie afin de red\u00e9finir la fa\u00e7on de faire des affaires sur des march\u00e9s financiers qui sont plus que jamais mondialis\u00e9s, complexes et dynamiques. Les investissements consid\u00e9rables de Morgan Stanley dans le domaine de la technologie se traduisent en des syst\u00e8mes de n\u00e9gociation quantitative, des logiciels de mod\u00e9lisation et de simulation de pointe, des syst\u00e8mes complets de gestion du risque et de la s\u00e9curit\u00e9 et de fortes capacit\u00e9s de gestion des relations-clients, auxquels s'ajoute une infrastructure mondiale qui constitue la clef de vo\u00fbte de ces syst\u00e8mes et outils. Ses connaissances, ses applications et son infrastructure procurent aux entreprises clientes de Morgan Stanley comme \u00e0 elle-m\u00eame un important avantage concurrentiel.<br><br>La mission de la division Technologies mondiale est de fournir une plateforme technologique commerciale extr\u00eamement fiable, qui appuie la strat\u00e9gie de la Soci\u00e9t\u00e9, via une \u00e9quipe de professionnels novateurs de renomm\u00e9e mondiale. La division Technologies englobe dix divisions. <br><br>La division Technologies de l\u2019entreprise et de gestion post-n\u00e9gociation se compose de quatre groupes orient\u00e9s vers le client, lesquels proposent des solutions technologiques \u00e0 des divisions \u00e0 l\u2019\u00e9chelle de l\u2019entreprise comme le Service du contentieux et de la conformit\u00e9, l\u2019\u00e9quipe Finances et gestion du risque de la Soci\u00e9t\u00e9 ainsi que la fonction de gestion post-n\u00e9gociation au sein du groupe Titres institutionnels. Chaque groupe orient\u00e9 vers le client se compose d\u2019un ensemble de secteurs, lesquels fournissent la technologie qui soutient un ensemble de fonctions connexes. Le groupe Technologie de gestion post-n\u00e9gociation assure la conception et le soutien de syst\u00e8mes permettant d\u2019automatiser les processus op\u00e9rationnels relatifs aux op\u00e9rations mondiales, comme le r\u00e8glement et la tenue des livres, une fois que l\u2019op\u00e9ration est comptabilis\u00e9e et confirm\u00e9e aupr\u00e8s du client. La Technologie de gestion post-n\u00e9gociation se compose de trois secteurs : Services multiproduits, Gestion des risques op\u00e9rationnels et contr\u00f4le et Produits d\u00e9riv\u00e9s hors cote. <br><br>Nous sommes \u00e0 la recherche d\u2019un d\u00e9veloppeur ou d\u2019une d\u00e9veloppeuse d\u2019exp\u00e9rience sur la plateforme Informatica pour notre \u00e9quipe TI \u2013 Applications fiscales de l\u2019entreprise. Son r\u00f4le sera de d\u00e9velopper des applications pour l\u2019\u00e9quipe Finances \u2013 Applications fiscales de l\u2019entreprise et d\u2019en assurer le soutien. L\u2019\u00e9quipe Applications fiscales a entrepris de r\u00e9nover ses syst\u00e8mes technologiques actuels et d\u2019augmenter leurs points de contact syst\u00e9matiques avec les logiciels du fournisseur actuel. Dans ce r\u00f4le de d\u00e9veloppement pratique, le ou la titulaire travaillera avec une \u00e9quipe de d\u00e9veloppeurs r\u00e9partie \u00e0 travers le monde pour concevoir et mettre au point des composantes technologiques dans le cadre d\u2019une s\u00e9rie de projets TI complexes. Le ou la titulaire devra \u00e9galement apporter son aide au gestionnaire du d\u00e9veloppement lors de la planification et de l\u2019ex\u00e9cution des projets. Cela inclut l\u2019analyse critique des processus d\u2019affaires cl\u00e9s et la formulation de recommandations techniques et architecturales afin d\u2019assurer l\u2019efficacit\u00e9 et la prise en charge des processus.<br><br>Ce poste exige de participer concr\u00e8tement \u00e0 la conception, au d\u00e9veloppement, \u00e0 la mise en \u0153uvre, au soutien et \u00e0 l\u2019optimisation des applications. Le candidat ou la candidate doit avoir de l\u2019exp\u00e9rience des techniques de conception orient\u00e9es objet et des pratiques exemplaires de g\u00e9nie logiciel, comme le cycle de vie de d\u00e9veloppement de logiciels, les revues de conception, la r\u00e9vision des codes, les essais unitaires et le r\u00e9usinage de code. Le ou la titulaire devra interagir avec une \u00e9quipe technique sur place et \u00e0 l\u2019\u00e9tranger, en plus de collaborer avec divers intervenants et membres du personnel \u00e0 l\u2019\u00e9chelle de l\u2019entreprise. Le candidat ou la candidate devrait \u00eatre capable de travailler de mani\u00e8re autonome et avoir de solides aptitudes \u00e0 l\u2019analyse et \u00e0 la r\u00e9solution de probl\u00e8mes.<br><br> <br><br><strong>Qualifications</strong><br><br> Required<br><br> - 5 years in designing and developing ETL process for data processing and warehousing<br>- 5 years hands-on Informatica workflow and transformation developement<br>- 3 years SQL development, debugging, and performance tuning<br>- 3 years in-depth relational database development (Sybase preferable) <br><br> Recommended<br><br> - 5 years strong Java / Perl programming skills<br>- Self-motivated and goal oriented with high degree of accountability.<br>- Experience in Financial services is preferred. Corporate tax experience is a plus.<br>- Excellent interpersonal and communication skills (verbal and written). <br><br> Morgan Stanley is an equal opportunities employer. We work to provide a supportive and inclusive environment where all individuals can maximise their full potential. <br><br>Comp\u00e9tences requises :<br><br>- Au moins 5 ans d\u2019exp\u00e9rience de conception et de d\u00e9veloppement de processus d'extraction, de transformation et de chargement pour le traitement et l'entreposage de donn\u00e9es.<br>- Au moins 5 ans d\u2019exp\u00e9rience pratique du d\u00e9veloppement des flux de travail et transformations Informatica<br>- Au moins 3 ans d\u2019exp\u00e9rience de d\u00e9veloppement, de d\u00e9bogage et d'optimisation du rendement avec SQL<br>- Au moins 3 ans d\u2019exp\u00e9rience approfondie du d\u00e9veloppement de bases de donn\u00e9es relationnelles (pr\u00e9f\u00e9rablement Sybase)<br><br>Comp\u00e9tences souhait\u00e9es :<br><br>- Au moins 5 ans d\u2019exp\u00e9rience et solides comp\u00e9tences en programmation avec Java/Perl<br>- Personne motiv\u00e9e, orient\u00e9e vers les buts et tr\u00e8s responsable<br>- Une exp\u00e9rience dans le domaine des services financiers serait pr\u00e9f\u00e9rable. Une exp\u00e9rience dans le domaine de l\u2019imp\u00f4t sur le revenu des soci\u00e9t\u00e9s serait un atout.<br>- Excellentes aptitudes aux relations interpersonnelles et \u00e0 la communication (orale et \u00e9crite).<br><br>Morgan Stanley est un employeur offrant l\u2019\u00e9galit\u00e9 professionnelle. Nous travaillons pour offrir un environnement de travail accueillant et favorable dans lequel toutes les personnes peuvent r\u00e9aliser leur plein potentiel.", "company": {"id": 497017, "name": "Morgan Stanley"}, "postingDate": {"year": 2014, "day": 11, "month": 2}, "locationDescription": "Canada-QC-Montreal", "expirationDate": {"year": 2014, "day": 13, "month": 3}, "position": {"experienceLevel": {"code": "3", "name": "Associate"}, "location": {"country": {"code": "ca"}, "name": "Montreal, Canada Area"}, "jobType": {"code": "F", "name": "Full-time"}, "title": "Developer - ETL // D\u00e9veloppeur (d\u00e9veloppeuse) - Processus d'extraction, de transformation et de chargement"}, "active": true, "customerJobCode": "3014788", "expirationTimestamp": 1394706957000, "id": 11554348, "postingTimestamp": 1392114956000}